<html>
<head>
    <title>Каталог</title>
    <link href="2/css/bootstrap.min.css" rel="stylesheet">
    <link href="2/css/style.css" rel="stylesheet">
</head>
<body>
<div class="container" align="center">

    <h4><a href='1/index.php'>Первое задание</a><br></h4>
    <div class="alert alert-info">
    <p>1) Нужно реализовать на PHP класс, который бы реализовывал следующие требования:
        метод для обработки строки, содержащей математическое выражение в обратной польской записи, и возвращающий результаты вычислений этого этого выражения;
        нужно иметь возможность быстро и безопасно расширять количество математических операций;
        должны быть соблюдены требования к коммерческому коду - стабильность, надежность и безопасность.</p>
    </div>
        <h4><a href='2/index.php'>Второе задание</a><br></h4>
    <div class="alert alert-info">
        2) Есть справочник пользователей, который выводится постранично с сортировкой по имени пользователя по возрастанию.
        Есть фичи добавления и редактирования пользователей. Планируется реализовать фичу,
        позволяющую после добавления/редактирования переходить на страницу, на которой располагается
        запись с пользователем и подсветить эту строку. Составьте SQL запрос, который бы возвращал номер
        страницы и номер строки для перехода и подсветки для известных направления сортировки
        (по возрастанию), имени (username='Геральт') и идентификатора пользователя (userid=141414)
        в таблице user.
    </div>

</div>
<script src="https://ajax.googleapis.com/ajax/libs/jquery/3.1.1/jquery.min.js"></script>
<script src="2/js/bootstrap.min.js"></script>

</body>
</html>